# OLDSetLoadDataBool

## Description
Using selector, sets load data with bool value for the parametric object

```pascal
PROCEDURE OLDSetLoadDataBool(
				handle    : HANDLE;
				selector  : INTEGER;
				value     : BOOLEAN;
				loadIndex : INTEGER);
```

```python

def vs.OLDSetLoadDataBool(handle, selector, value, loadIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|selector|INTEGER||
|value|BOOLEAN||
|loadIndex|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis